library = {"Маленький принц": {"Автор": "Антуана де Сент-Экзюпери", "Год издания": "1943", "Наличие": "В наличии"},
           "Повелитель мух": {"Автор": "Уильям Голдинг", "Год издания": "1983", "Наличие": "Нет в наличии"},
           "Мастер и маргарита": {"Автор": "Михаил Афанасьевич Булгаков", "Год издания": "1967 ", "Наличие": "В наличии"},
           }


def book_list_view(library):
    if len(library) == 0:
        print("В библиотеке нет книг")
    for key in list(library.keys()):
        print(key)
    return


book_list_view(library)
