def book_list_view(library):
    if not library:
        print("В библиотеке нет книг")
        return
    for key in library:
        print(key)
    return


library = {
    "Маленький принц": {
        "Автор": "Антуана де Сент-Экзюпери", "Год издания": "1943", "Наличие": "В наличии"
    },
    "Повелитель мух": {
        "Автор": "Уильям Голдинг", "Год издания": "1983", "Наличие": "Нет в наличии"
    },
    "Мастер и маргарита": {
        "Автор": "Михаил Афанасьевич Булгаков", "Год издания": "1967 ", "Наличие": "В наличии"
    },
}


book_list_view(library)
